/*jshint esversion: 6 */

// Дни недели

// Инициализируем массив с днями недели

let week = ["Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье"];

// Инициализируем массив из 7-ми многозначных чисел

let arr = ["20938457", "3478829057", "29783458", "7198351325", "712398546", "781235987", "19287356192"];

/* Выводим с условиями, что выходные должны быть Жирным шрифтом, а текущий день 
Курсивом */

for (let i = 0; i < 7; i++) {
	if ( week[i] === "Суббота" || week[i] === "Воскресенье" ) {
		//console.log( '%c%s', 'font-weight: 600;', week[i] );
		console.log ( '%c%s', 'font: bold 1rem Tahoma; ', week[i] );
	} else  if ( week[i] === "Среда" ) {
			console.log ( '%c%s', 'font: italic 1rem Tahoma; ', week[i] );
		} else {
			console.log( week[i] );
			}
}

// Выводим с условием, что элемент массива начинаеться с 3 или 7

for ( let i = 0; i < 7; i++ ) {
	let temp = arr[i]; 
	if ( temp.charAt(0) === "3" || temp.charAt(0) === "7") {
		console.log ( arr[i] );
	}
}